
__docformat__ = 'restructuredtext ru'

from aitkit import corpora, models, testdata, utils

# aitkit докстринг
__doc__ = """
aitkit-мощная библиотека анализа и обработки данных для Python
=====================================================================

**aitkit** - анализ текстов, предоставляющий ** гибкие инструменты с открытым исходным кодом
**. Это уже хорошо.

Наконец, это просто пакет Python.

основной функционал:
-------------
Вот лишь некоторые из values, которые aitkit делает хорошо:

  - Высокопроизводиельные инструменты борьбы с массивом текстов,
        Файлы Excel, базы данных и сохранение / загрузка данных из др..
  - Функциональность улучшайзера стемминга и/или лемматизации 
"""
