# -*- coding:utf-8 -*-
__author__ = 'denishuang'

VERIFY_WAIT = 0
VERIFY_PASS = 1
VERIFY_DENY = 2

MATCH_WAIT = 0
MATCH_PASS = 1
MATCH_DENY = 2
MATCH_DELETE = 3

STATUS_WEISHIXI = 0
STATUS_SHIXIZHONG = 1
STATUS_ZHENGSHI = 2
STATUS_LIZHI = 4
STATUS_ZHONGZHUANGAO = 5
STATUS_SHENGXUE = 6
STATUS_CANJUN = 7

VERIFY_CHOICES = (
    (VERIFY_WAIT, u"未审核"),
    (VERIFY_PASS, u"审核通过"),
    (VERIFY_DENY, u"审核不通过"),
)

CHOICES_MATCH = (
    (MATCH_WAIT, u"未审核"),
    (MATCH_PASS, u"对口"),
    (MATCH_DENY, u"不对口"),
    (MATCH_DELETE, u"已删除")
)

CHOICES_STATUS = (
    (STATUS_WEISHIXI, u"未实习"),
    (STATUS_SHIXIZHONG, u"实习"),
    (STATUS_ZHENGSHI, u"正式员工"),
    (STATUS_LIZHI, u"离职"),
    (STATUS_ZHONGZHUANGAO, u"中转高"),
    (STATUS_SHENGXUE, u"升学"),
    (STATUS_CANJUN, u"参军")
)

TYPE_DANWEI = 1
TYPE_WANGDIAN = 2
TYPE_JIAJIAO = 3
TYPE_SHENGXUE = 4
TYPE_CANJUN = 5

CHOICES_TYPE = (
    (TYPE_DANWEI, u"单位实习"),
    (TYPE_WANGDIAN, u"网店"),
    (TYPE_JIAJIAO, u"家教"),
    (TYPE_SHENGXUE, u"升学"),
    (TYPE_CANJUN, u"参军")
)

WORKING_STATUS_LIST = (
    STATUS_SHIXIZHONG,
    STATUS_ZHENGSHI,
    STATUS_SHENGXUE,
    STATUS_CANJUN
)

DANGYUAN = 0
TUANYUAN = 1
QUNZHONG = 2
CHOICES_POLITICS = (
    (DANGYUAN, u"党员"),
    (TUANYUAN, u"共青团员"),
    (QUNZHONG, u"群众"),
)

CHOICES_SALARY = (
    (None, u"不限"),
    ("01", u"2000元/月以下"),
    ("02", u"2001-3000元/月"),
    ("03", u"3001-4500元/月"),
    ("04", u"4501-8000元/月"),
    ("05", u"8001-10000元/月"),
    ("06", u"10001-15000元/月"),
    ("07", u"15001-20000元/月"),
    ("08", u"20001-30000元/月"),
    ("09", u"30001-50000元/月"),
    ("10", u"50000元/月以上"),
)


JIUYEXIEYI = 0
LAODONGHETONG = 1
QITALUYONG = 2
QITAQINGKUANG = 3
CHOICES_GRADUATE_GOES = (
    (JIUYEXIEYI, u"签就业协议形式就业"),
    (LAODONGHETONG, u"签劳动合同形式就业"),
    (QITALUYONG, u"其他录用形式就业"),
    (QITAQINGKUANG, u"其他情况")
)

XINGZHENG = 0
SHEJI = 1
GUANLI = 2
SHENGCHAN = 3
DUSHU = 4
DAIYE = 5
FUYI = 6
QITA = 7
CHOICES_BEHAVIOR_INTENTION = (
    (XINGZHENG, u"行政"),
    (SHEJI, u"设计"),
    (GUANLI, u"管理"),
    (SHENGCHAN, u"生产"),
    (DUSHU, u"读书"),
    (DAIYE, u"待业"),
    (FUYI, u"服役"),
    (QITA, u"其他"),
)

ZCPQ = 0
ZHJY = 1
BNRJY = 2
CHOICES_DISPATCH_NATURE = (
    (ZCPQ, u"正常派遣"),
    (ZHJY, u"申请暂缓就业"),
    (BNRJY, u"不纳入就业方案"),
)

STYY = 0
XLYY = 1
JTYY = 2
CHOICES_DIFFICULT_STUDENT_TYPE = (
    (ZCPQ, u"身体原因"),
    (ZHJY, u"心理原因"),
    (BNRJY, u"家庭原因"),
)

YUEZHONG = 1
YUEDI = 2
CHOICES_FEEDBACK_ORDER = (
    (YUEZHONG, u"月中反馈"),
    (YUEDI, u"月底总结")
)

CHOICES_SCHOOL_RECOMMEND = (
    (1, u"学校宣讲招聘会"),
    (2, u"学校大型现场招聘会"),
    (3, u"学校招聘网推荐"),
    (4, u"学校老师推荐")
)

DEFAULTS_POSITION = {
    TYPE_CANJUN: u"军人",
    TYPE_SHENGXUE: u"学生"
}
DEFAULTS_GRADUATE_GOES = {}
DEFAULTS_INSTITUTION_TYPE = {
    TYPE_SHENGXUE: "50102",
    TYPE_CANJUN: "40102"
}
DEFAULTS_INSTITUTION_INDUSTRY = {
    TYPE_SHENGXUE: "168200",
    TYPE_CANJUN: "199100"
}
DEFAULTS_BEHAVIOR_INTENTION = {
    TYPE_SHENGXUE: DUSHU,
    TYPE_CANJUN: FUYI
}

INSTITUTION_TYPE_DATA = u"""
10000 机关、部队、党群及政法系统
10100 国家机关
10101 中央及省（自治区、直辖市）属的国家机关
10102 地市（州、盟、省辖市）厅局属的国家机关
10103 县（辖市、旗）属的国家机关
10104 乡镇属的国家机关
10200 党群系统
10201 中央及省（自治区、直辖市）属的党群系统
10202 地市（州、盟、省辖市）厅局属的党群系统
10203 县（辖市、旗）属的党群系统
10204 乡镇属的党群系统
10300 政法系统
10301 中央及省（自治区、直辖市）属的政法系统
10302 地市（州、 盟、省辖市）厅局属的政法系统
10303 县（辖市、旗）属的政法系统
10304 乡镇属的政法系统
10400 部队、武警、部队院校
10401 中国人民解放军
10402 中国人民武装警察部队
10403 部队院校
10500 社会团体
10501 社会团体
19900 其他机关、部队、党群及政法系统单位
19901 其他机关、部队、党群及政法系统单位
20000 事业单位
20100 高等院校
20101 普通本科院校
20102 高职高专院校
20103 民办院校
20104 独立学院
20105 部门（企业）办学院校
20199 其他高等院校
20200 普教系统
20201 完全中学
20202 高中
20203 初中
20204 小学
20205 幼儿园
20206 中专（技校）
20207 民办普教学校
20299 其他普教系统
20300 科研设计单位
20301 中央及省（自治区、直辖市）属的科研设计单位
20302 地市（州、盟、省辖市）厅局属的科研设计单位
20303 县（辖市、旗）属的科研设计单位
20304 乡镇属的科研设计单位
20399 其他科研设计单位
20400 医疗卫生单位
20401 中央及省（自治区、直辖市）属的医疗卫生单位
20402 地市（州、盟、省辖市）厅局属的医疗卫生单位
20403 县（辖市、旗）属的医疗卫生单位
20404 乡镇属的医疗卫生单位
20499 其他医疗卫生单位
29900 其他事业单位
29901 其他事业单位
30000 企业单位
30100 国有企业
30101 中央及省（自治区、直辖市）属的国有企业
30102 地市（州、盟、省辖市）厅局属的国有企业
30103 县（辖市、旗）属的国有企业
30104 乡镇属的国有企业
30199 其他国有企业
30200 集体企业
30201 集体企业
30300 股份合作企业
30301 股份合作企业
30400 联营企业
30401 联营企业
30500 有限责任公司
30501 有限责任公司
30600 股份有限公司
30601 股份有限公司
30700 私营企业
30701 私营企业
30800 港、澳、台商投资企业
30801 港、澳、台商投资企业
30900 外商投资企业
30901 外商投资企业
39900 其他企业
39901 其他企业
40000 其他就业形式
40100 国家项目
40101 西部计划
40102 应征义务兵
40200 地方项目
40201 选调生
40202 三支一扶
40203 农村教育硕士
40204 科研助理
40205 农村建制村
40300 自由职业
40301 家教
40302 网店
40303 自由（自雇）职业艺术工作者
40304 其他自由职业
40400 自主创业
40401 团队创业
40402 加盟经营
40403 技术转化创业
40404 项目孵化创业
40405 创意创业
40406 网络营销
40407 个体创业
40408 其他创业
50000 升学
50100 升学
50101 升学
50102 其他形式再学习
80000 出国、出境
80100 出国、出境
80101 出国、出境
90000 未就业
90100 停用
90101 （停用）不列入就业率统计
90102 （停用） 待就业
90200 有就业意愿尚未就业
90201 求职中
90202 签约中
90203 拟参加公招考试
90204 拟创业
90205 拟应征入伍
90300 暂不就业
90301 无就业意愿
90302 拟升学
90303 拟出国出境
"""

INSTITUTION_TYPE_CHOICES = [(line[0:5].strip(), line[6:].strip()) for line in INSTITUTION_TYPE_DATA.split("\n")]

INSTITUTION_INDUSTRY_DATA = u"""
10000  农、林、牧、渔业
10100  农业
10200  林业
10300  畜牧业
10400  渔业
10500  农、林、牧、渔服务业
20000  采矿业
20600  煤炭开采和洗选业
20700  石油和天然气开采业
20800  黑色金属矿采选业
20900  有色金属矿采选业
21000  非金属矿采选业
21100  开采辅助活动
21200  其他采矿业
30000  制造业
31300  农副食品加工业
31400  食品制造业
31500  酒、饮料和精制茶制造业
31600  烟草制品业
31700  纺织业
31800  纺织服装、服饰业
31900  皮革、毛皮、羽毛及其制品和制鞋业
32000  木材加工和木、竹、藤、棕、草制品业
32100  家具制造业
32200  造纸和纸制品业
32300  印刷和记录媒介复制业
32400  文教、工美、体育和娱乐用品制造业
32500  石油加工、炼焦和核燃料加工业
32600  化学原料和化学制品制造业
32700  医药制造业
32800  化学纤维制造业
32900  橡胶和塑料制品业
33000  非金属矿物制品业
33100  黑色金属冶炼和压延加工业
33200  有色金属冶炼和压延加工业
33300  金属制品业
33400  通用设备制造业
33500  专用设备制造业
33600  汽车制造业
33700  铁路、船舶、航空航天和其他运输设备制造业
33800  电气机械和器材制造业
33900  计算机、通信和其他电子设备制造业
34000  仪器仪表制造业
34100  其他制造业
34200  废弃资源综合利用业
34300  金属制品、机械和设备修理业
40000  电力、热力、燃气及水生产和供应业
44400  电力、热力生产和供应业
44500  燃气生产和供应业
44600  水的生产和供应业
50000  建筑业
54700  房屋建筑业
54800  土木工程建筑业
54900  建筑安装业
55000  建筑装饰和其他建筑业
60000  批发和零售业
65100  批发业
65200  零售业
70000  交通运输、仓储和邮政业
75300  铁路运输业
75400  道路运输业
75500  水上运输业
75600  航空运输业
75700  管道运输业
75800  装卸搬运和运输代理业
75900  仓储业
76000  邮政业
80000  住宿和餐饮业
86100  住宿业
86200  餐饮业
90000  信息传输、软件和信息技术服务业
96300  电信、广播电视和卫星传输服务
96400  互联网和相关服务
96500  软件和信息技术服务业
100000 金融业
106600 货币金融服务
106700 资本市场服务
106800 保险业
106900 其他金融业
110000 房地产业
117000 房地产业
120000 租赁和商务服务业
127100 租赁业
127200 商务服务业
130000 科学研究和技术服务业
137300 研究和试验发展
137400 专业技术服务业
137500 科技推广和应用服务业
140000 水利、环境和公共设施管理业
147600 水利管理业
147700 生态保护和环境治理业
147800 公共设施管理业
150000 居民服务、修理和其他服务业
157900 居民服务业
158000 机动车、电子产品和日用产品修理业
158100 其他服务业
160000 教育
168200 教育
170000 卫生和社会工作
178300 卫生
178400 社会工作
180000 文化、体育和娱乐业
188500 新闻和出版业
188600 广播、电视、电影和影视录音制作业
188700 文化艺术业
188800 体育
188900 娱乐业
190000 公共管理、社会保障和社会组织
199000 中国共产党机关
199100 国家机构
199200 人民政协、民主党派
199300 社会保障
199400 群众团体、社会团体和其他成员组织
199500 基层群众自治组织
200000 国际组织
209600 国际组织"""

INSTITUTION_INDUSTRY_CHOICES = [(line[0:6].strip(), line[7:].strip()) for line in INSTITUTION_INDUSTRY_DATA.split("\n")]

JOB_TYPE_DATA = u"""
10000 国家机关、党群组织、企业、事业单位负责人
10100 中国共产党中央委员会和地方各级党组织负责人.
10101 中国共产党中央委员会和地方各级党组织负责人..
10200 国家机关及其工作机构负责人
10201 国家权力机关及其工作机构负责人
10202 人民政协及其工作机构负责人
10203 人民法院负责人
10204 人民检察院负责人
10205 国家行政机关及其工作机构负责人
10299 其他国家机关及其工作机构负责人
10300 民主党派和社会团体及其工作机构负责人
10301 民主党派负责人
10302 工会、共青团、妇联等人民团体及其工作机构负责人
10303 群众自治组织负责人
10399 其他社会团体及其工作机构负责人
10400 事业单位负责人
10401 教育教学单位负责人
10402 卫生单位负责人
10403 科研单位负责人
10499 其他事业单位负责人
10500 企业负责人.
10501 企业负责人..
20000 专业技术人员
20100 科学研究人员
20101 哲学研究人员
20102 经济学研究人员
20103 法学研究人员
20104 社会学研究人员
20105 教育科学研究人员
20106 文学、艺术研究人员
20107 图书馆学、情报学研究人员
20108 历史学研究人员
20109 管理科学研究人员
20110 数学研究人员
20111 物理学研究人员
20112 化学研究人员
20113 天文学研究人员
20114 地球科学研究人员
20115 生物科学研究人员
20116 农业科学研究人员
20117 医学研究人员
20199 其他科学研究人员
20200 工程技术人员
20201 地质勘探工程技术人员
20202 测绘工程技术人员
20203 矿山工程技术人员
20204 石油工程技术人员
20205 冶金工程技术人员
20206 化工工程技术人员
20207 机械工程技术人员
20208 兵器工程技术人员
20209 航空工程技术人员
20210 航天工程技术人员
20211 电子工程技术人员
20212 通信工程技术人员
20213 计算机与应用工程技术人员
20214 电气工程技术人员
20215 电力工程技术人员
20216 邮政工作技术人员
20217 广播电影电视技术人员
20218 交通工程技术人员
20219 民用航空交通工程技术人员
20220 铁路工程技术人员
20221 建筑工程技术人员
20222 建材工程技术人员
20223 林业工程技术人员
20224 水利工程技术人员
20225 海洋工程技术人员
20226 水产工程技术人员
20227 纺织工程技术人员
20228 食品工程技术人员
20229 气象工程技术人员
20230 地震工程技术人员
20231 环境保护工程技术人员
20232 安全工程技术人员
20233 标准化、计量、质量工程技术人员
20234 管理（工业）工程技术人员
20235 生物技术工程人员
20299 其他工程技术人员
20300 农业技术人员
20301 土壤肥料技术人员
20302 植物保护技术人员
20303 园艺技术人员
20304 作物遗传育种栽培技术人员
20305 兽医兽药技术人员
20306 畜牧与草业技术人员
20399 其他农业技术人员
20400 飞机和船舶技术人员
20401 飞行人员和领航人员
20402 船舶指挥和引航人员
20499 其他飞机和船舶技术人员
20500 卫生专业技术人员
20501 西医医师
20502 中医医师
20503 中西医结合医师
20504 民族医师
20505 公共卫生医师
20506 药剂人员
20507 医疗技术人员
20508 护理人员
20599 其他卫生专业技术人员
20600 经济业务人员
20601 经济计划人员
20602 统计人员
20603 会计人员
20604 审计人员
20605 国际商务人员
20699 其他经济业务人员
20700 金融业务人员
20701 银行业务人员
20702 保险业务人员
20703 证券业务人员
20799 其他金融业务人员
20800 法律专业人员
20801 法官
20802 检察官
20803 律师
20804 公证员
20805 司法鉴定人员
20806 书记员
20899 其他法律专业人员
20900 教学人员
20901 高等教育教师
20902 中等职业教育教师
20903 中学教师
20904 小学教师
20905 幼儿教师
20906 特殊教育教师
20999 其他教学人员
21000 文学艺术工作人员
21001 文艺创作和评论人员
21002 编导和音乐指挥人员
21003 演员
21004 乐器演奏员
21005 电影电视制作及舞台专业人员
21006 美术专业人员
21007 工艺美术专业人员
21099 其他文学艺术工作人员
21100 体育工作人员
21101 体育工作人员
21200 新闻出版、文化工作人员
21201 记者
21202 编辑
21203 校对员
21204 播音员及节目主持员
21205 翻译
21206 图书资料与档案业务人员
21207 考古及文物保护专业人员
21299 其他新闻出版、文化工作人员
21300 宗教职业者.
21301 宗教职业者..
29900 其他专业技术人员.
29901 其他专业技术人员..
30000 办事人员和有关人员
30100 行政办公人员
30101 行政业务人员
30102 行政事务人员
30199 其他行政办公人员
30200 安全保卫和消防人员
30201 人民警察
30202 治安保卫人员
30203 消防人员
30299 其他安全保卫和消防人员
30300 邮政和电信业务人员
30301 邮政业务人员
30302 电信业务人员
30303 电信通信传输业务人员
30399 其他邮政和电信业务人员
39900 其他办事人员及有关部门人员.
39901 其他办事人员及有关部门人员..
40000 商业、服务业人员
40100 购销人员
40101 营业人员
40102 推销、展销人员
40103 采购人员
40104 拍卖、典当及租赁业务人员
40105 废旧物资回收利用人员
40106 粮油管理人员
40107 商品监监督和市场管理人员
40199 其他购销人员
40200 仓储人员
40201 保管人员
40202 储运人员
40299 其他储运人员
40300 餐饮服务人员
40301 中餐烹饪人员
40302 西餐烹饪人员
40303 调酒和茶艺人员
40304 营养配餐人员
40305 餐厅服务人员
40399 其他餐饮服务人员
40400 饭店、旅游及健身娱乐场所服务人员
40401 饭店服务部人员
40402 旅游及公共游览场所服务人员
40403 健身和娱乐场所服务人员
40499 其他饭店、旅游及健身娱乐场所服务人员
40500 运输服务人员
40501 公路道路运输服务人员
40502 铁路客货运输服务人员
40503 航空运输服务人员
40504 水上运输服务人员
40599 其他运输服务人员
40600 医疗卫生辅助服务人员.
40601 医疗卫生辅助服务人员..
40700 社会服务和居民生活服务人员
40701 社会中介服务人员
40702 物业管理员
40703 供水、供热及生活燃料供应服务人员
40704 美容美发人员
40705 摄影服务人员
40706 验光配镜人员
40707 洗染织补人员
40708 浴池服务人员
40709 印章刻字人员
40710 日用机电产品维修人员
40711 办公设备维修人员
40712 保育、家庭服务人员
40713 环境卫生人员
40714 殡葬服务人员
40799 其他社会服务和居民生活服务人员
49900 其他商业、服务业人员.
49901 其他商业、服务业人员..
50000 农、林、牧、渔、水利业生产人员
50100 种植业生产人员
50101 大田作物生产人员
50102 农业实验人员
50103 园艺作物生产人员
50104 热带作物生产人员
50105 中药材生产人员
50106 农副林特产品加工人员
50199 其他种植业生产人员
50200 林业生产及野生动植物保护人员
50201 营造林人员
50202 森林资源管护人员
50203 野生动植物保护及自然保护区人员
50204 木材采运工人
50299 其他林业生产及野生动植物保护人员
50300 畜牧业生产人员
50301 家畜饲养员
50302 家禽饲养员
50303 蜜蜂饲养人员
50304 实验动物饲养人员
50305 动物疫病防治人员
50306 草业生产人员
50399 其他畜牧业生产人员
50400 渔业生产人员
50401 水产养殖人员
50402 水产捕捞及有关人员
50403 水产品加工人员
50499 其他渔业生产人员
50500 水利设施管理养护人员
50501 河道、水库管养人员
50502 农田灌排工程建设管理维护人员
50503 水土保持作业人员
50504 水文勘测作业人员
50599 其他水利设施管理养护人员
59900 其他农、林、牧、渔、水利业生产人员
59901 农林专用机械操作人员
59902 农村能源开发利用人员
60000 生产、运输设备操作人员及有关人员
60100 勘测及矿物开采人员
60101 地质勘查人员
60102 测绘人员
60103 矿物开采人员
60104 矿物处理人员
60105 钻井人员
60106 石油、天然气开采人员
60107 盐业生产人员
60199 其他勘测及矿物开采人员
60200 金属冶炼、轧制人员
60201 炼铁人员
60202 炼钢人员
60203 铁合金冶炼人员
60204 重有色金属冶炼人员
60205 轻有色金属冶炼人员
60206 稀贵金属冶炼人员
60207 半导体材料制备人员
60208 金属轧制人员
60209 铸铁管人员
60210 碳素制品生产人员
60211 硬质合金生产人员
60299 其他金属冶炼轧制人员
60300 化工产品生产能力人员
60301 化工产品生产通用工艺人员
60302 石油炼制生产人员
60303 煤化工生产人员
60304 化学肥料生产人员
60305 无机化工产品生产人员
60306 基本有机化工产品生产人员
60307 合成树脂生产人员
60308 合成橡胶生产人员
60309 化学纤维生产人员
60310 合成革生产人员
60311 精细化工产品生产人员
60312 信息记录材料生产人员
60313 火药制造人员
60314 炸药制造人员
60315 林产化工产品生产人员
60316 复合材料加工人员
60317 日用化学品生产人员
60399 其他化工产品生产人员
60400 机械制造加工人员
60401 机械冷加工人员
60402 机械热加工人员
60403 特种加工设备操作人员
60404 冷作钣金加工人员
60405 工件表面处理加工人员
60406 磨料磨具制造加工人员
60407 航天器件加工成型人员
60499 其他机械制造加工人员
60500 机电产品装配人员
60501 基础件部件装配人员
60502 机械设备装配工
60503 动力设备装配人员
60504 电器元件及设备装配人员
60505 电子专用设备装配调试人员
60506 仪器仪表装配人员
60507 运输车辆装配人员
60508 膜法水处理设备制造人员
60509 医疗器械装配及假肢与矫形器制作人员
60510 日用机械电器制造装配人员
60511 五金制品制作装配人员
60512 装甲车辆装试人员
60513 枪炮制造人员
60514 弹制造人员
60515 引信加工制作人员
60516 火工品制造人员
60517 防化器材制造人员
60518 船舶制造人员
60519 航空产品装配与调试人员
60520 航空产品实验员
60521 导弹卫星装配测试人员
60522 火箭发动机装配实验人员
60523 航天器结构强度温度环境实验人员
60524 靶场实验人员
60599 其他机电产品装配人员
60600 机械设备修理人员
60601 机械设备修理人员
60602 仪器仪表修理人员
60603 民用航空器维修人员
60699 其他机械设备修理人员
60700 电力设备安装、运行、检修及供电人员
60701 电力设备安装人员
60702 发电运行值班人员
60703 输电配电变电设备值班人员
60704 电力设备检修人员
60705 供用电人员
60706 生活生产电力设备安装操作修理人员
60799 其他电力设备安装运行检修继供电人员
60800 电子元器件与设备制造、装配调试及维修人员
60801 电子器件制造人员
60802 电子元件制造人员
60803 电池制造人员
60804 电子设备装配调试人员
60805 电子产品维修人员
60899 其它电子元器件与设备制造装配调试维修人员
60900 橡胶和塑料制品生产人员
60901 橡胶制品生产人员
60902 塑料制品人员
60999 其他橡胶和塑料制品加工人员
61000 纺织、针织、印染人员
61001 纤维预处理人员
61002 纺纱人员
61003 织造人员
61004 针织人员
61005 印染人员
61099 其他纺织、针织、印染人员
61100 裁剪缝纫和皮革、毛皮制品加工人员
61101 裁剪缝纫人员
61102 鞋帽制作人员
61103 皮革、皮毛加工人员
61104 缝纫制品再加工人员
61199 其他裁剪缝纫和皮革、毛皮制品加工人员
61200 粮油、食品、饮料生产加工及饲料生产加工人员
61201 粮油生产加工人员
61202 制糖和糖制品加工人员
61203 乳品、冷食品、及罐头、饮料制作员
61204 酿酒人员
61205 食品添加剂及调味品制作人员
61206 粮油食品制作人员
61207 屠宰加工人员
61208 肉、蛋食品加工人员
61209 饲料生产加工人员
61299 其他粮油、食品、饮料生产加工及饲料生产加工人员
61300 烟草及其制造加工人员
61301 原烟复烤人员
61302 卷烟生产人员
61303 烟用醋酸纤维丝束滤棒制作人员
61399 其他烟草及其制造加工人员
61400 药品生产人员
61401 合成药物制造人员
61402 生物技术制药（品）人员
61403 药物制剂人员
61404 中药制药人员
61499 其他药品生产人员
61500 木材加工、人造板生产及木材制品制作人员
61501 木材加工人员
61502 人造板生产人员
61503 木材制品制作人员
61599 其他木材加工、人造板生产及木材制品制作人员
61600 制浆、造纸和纸制品生产加工人员
61601 制浆人员
61602 造纸人员
61603 纸制品制作人员
61699 其他制浆、造纸和纸制品生产加工人员
61700 建筑材料生产加工人员
61701 水泥及水泥制品生产加工人员
61702 墙体屋面材料生产工
61703 建筑防水密封材料生产人员
61704 建筑保温及吸音材料生产人员
61705 装饰材料生产人员
61706 非金属矿及其制品生产加工人员
61707 耐火材料生产人员
61799 其他建筑材料生产加工人员
61800 玻璃、陶瓷、搪瓷及其制品生产加工人员
61801 玻璃溶制人员
61802 玻璃纤维及制品生产人员
61803 石英玻璃制品加工人员
61804 陶瓷制品生产人员
61805 搪瓷制品生产人员
61899 其他玻璃、陶瓷、搪瓷及其制品生产加工人员"""

JOB_TYPE_CHOICES = [(line[0:5].strip(), line[6:].strip()) for line in JOB_TYPE_DATA.split("\n")]
